Autodesk.Revit.DB.Architecture.RoomTag.TaggedRoomId
The LinkElementId of the tagged room.
Remarks: If there is no tagged room in a linked document so the RoomTag is orphaned, LinkElementId will be InvalidElementId.
Since: 2017

Autodesk.Revit.DB.Architecture.RoomTag.TaggedLocalRoomId
The ElementId of the tagged room.
Remarks: If there is no tagged room so the RoomTag is orphaned, ElementId will be InvalidElementId.
Since: 2017

Autodesk.Revit.DB.Architecture.RoomTag.IsInRoom
Identifies if the tag is located in a room.
Remarks: In some cases the tag may not be located in a room so it looses temporairly an association with the room.
Since: 2017

Autodesk.Revit.DB.Architecture.RoomTag.RoomTagType
The tag type.

Autodesk.Revit.DB.Architecture.RoomTag.Room
The room that the tag is associated with.
Remarks: In rare cases, the tag may not be associated to a room.  The property will
be null in these situations.

Autodesk.Revit.DB.Architecture.RoomTag
Provides access to the room tag in Autodesk Revit.